;;; ttc-ltbl.el --- TT-Code left table data

(setq tcode-tbl [
"* * * * Ээ* * * * * * * * * 庇媛葡娩鉾* * * * * 迄孟佑螺稜* * * * * 呂亘拉* * "
"* * * * Юю* * * * * * * * * 匪桧撫篇鵬* * * * * 沫摸愈淀瞭* * * * * 蓮亙憬* * "
"* * * * Яя* * * * * * * * * 蕃逼阜箆鳳* * * * * 俣麺鑓沃梁* * * * * 聯鷲慄* * "
"* * * * * * * * * * * * * * * 磐畢芙蔑鋒* * * * * 亦緬薮慾凌* * * * * 簾脇惧* * "
"* * * * * * * * * * * * * * * 挽弼斧瞥蜂* * * * * 桝棉靖遥亮* * * * * 煉歪恣錮* "
"* * * * * * * * * * 肱梧捲袈矩* * * * * 蒐叱燦埼痕* * * * * 岨脊諏丞哨* * * * * "
"* * * * * * * * * * 腔檎硯祁躯* * * * * 讐嫉珊碕艮* * * * * 曾蹟厨擾嘗* * * * * "
"* * * * * * * * * * 膏瑚鍵圭駈* * * * * 蹴悉纂鷺些* * * * * 曽碩逗杖妾* * * * * "
"* * * * * * * * * * 砿醐鹸珪駒* * * * * 酋蔀讃咋叉* * * * * 楚蝉翠穣娼* * * * * "
"* * * * * * * * * * 閤鯉絃慧喰* * * * * 什篠餐朔嵯* * * * * 狙尖錐埴庄* * * * * "
"* * ΑＡАаａα* * 叡窺郁鮎葵簸廟淵輔釦鰹柿恢嘉艶蜜餅涌蘭琳僅禦誼玩粥弄椀璧* * "
"* * ΒＢБбｂβ* * 餌鵜亥綾姶樋豹蕗甫穆葛蛙廻伽燕箕勿湧藍燐粁鋸蟻巌萱婁蕨鬱* * "
"* * ΓＣВвｃγ* * 荏卯謂絢挨誹瓢葺圃睦恰馨駕俺焔蔓杢柚嵐淋桐渠祇舘茅賂藁楷* * "
"* * ΔＤГгｄδ* * 云迂萎飴娃緋彪楓鋪頬鰍浬蛾牡掩麿儲揖洛遼尭笈妓韓栢櫓詫曖* * "
"* * ΕＥДдｅε* * 噂烏畏虻唖斐謬蕪鞭吠梶骸臥桶怨侭蒙宥莱諒饗灸亀諌鴨魯鰐摯* * "
"* * ΖＦЕеｆζ* * 鴻佼舷桂寓蒼岱蛸綻凋戎偲斬柵沙槻挺纏塘鴇疏撰瑞拭廠遁汝嚢蝿筈"
"* * ΗＧЁёｇη* * 劫倖諺畦串鎗戴只耽喋夙柴仔窄瑳佃梯甜套涜蘇栴嵩燭捷頓迩膿秤櫨"
"* * ΘＨЖжｈθ* * 壕勾乎稽櫛捉腿叩蛋寵峻屡屍鮭裟柘汀貼宕禿遡煎雛蝕昌呑匂覗矧畠"
"* * ΙＩЗзｉι* * 濠喉姑繋釧袖苔辰檀帖竣蕊孜笹坐辻碇顛嶋栃叢煽椙尻梢那賑蚤萩溌"
"* * ΚＪИиｊκ* * 轟垢狐罫屑其黛巽弛暢舜縞斯匙挫蔦禎澱梼橡爽穿菅晋樟乍虹播剥醗"
"* * ΛＫЙйｋλ* * 穎蔚允闇葦柊鰭焚庖哩兜撹凱蝦旺牟悶傭葎嶺禽匡橘伎桓聾哺羞* * "
"* * ΜＬКкｌμ* * 盈欝鰯按旭眉蛭扮峯昧鞄廓蟹茄甥粍貰輿裡伶欽兇桔雁柑篭刹緻* * "
"* * ΝＭЛлｍν* * 瑛唄茨袷渥琵蒜吻呆幌樺劃芥苛鴛稔籾邑璃瑠欣僑吃贋姦狼傲籠* * "
"* * ΞＮМмｎξ* * 洩嘘溢粟穐毘鋲鮒菩殆椛鈎晦禾薗蓑* 祐梨麟錦侠鞠翫侃牢丼箋* * "
"* * ΟＯНнｏο* * 嬰碓磯或茜枇錨弗戊勃叶蛎魁珂苑湊尤猷李鱗巾亨掬癌苅榔碗瘍* * "
"* * ΠＰОоｐπ* * 麹宏糊荊窟揃鯛竪智牒駿紗獅拶哉綴諦兎淘椴宋箭頗榛樵凪廿杷柏筏"
"* * ΡＱПпｑρ* * 鵠巷袴詣沓遜醍辿蜘蝶楯杓爾* 塞鍔蹄堵涛鳶匝羨雀疹湘薙韮琶箔鳩"
"* * ΣＲРрｒσ* * 漉庚股頚轡汰鷹狸馳諜淳灼痔薩采椿鄭妬燈苫惣腺裾秦菖謎濡罵粕噺"
"* * ΤＳСсｓτ* * 甑昂胡戟窪唾瀧鱈筑銚醇錫而皐犀潰釘屠祷寅掻舛摺芯蒋灘禰芭曝塙"
"* * ΥＴТтｔυ* * 忽晃菰隙熊柁啄樽註捗曙惹蒔鯖砦壷鼎杜董酉槍詮凄塵蕉捺祢盃莫蛤"
"* * ΦＵУуｕφ* * 奄閏吋椅姐肘冨碧蓬鱒噛橿鎧峨臆牝弥蓉侶漣玖蕎汲徽莞倭彙辣* * "
"* * ΧＶФфｖχ* * 堰瓜蔭惟斡膝埠僻萌柾鎌樫蓋俄荻姪耶耀琉憐狗怯仇稀翰肋毀踪* * "
"* * ΨＷХхｗψ* * 厭厩胤夷梓髭瀕頁烹鮪釜笠碍霞鴎冥爺熔溜苓倶彊黍畿竿禄嘲貪* * "
"* * ΩＸЦцｘω* * 榎姥淫杏鯵疋斌蔽朋枕蒲顎崖迦鴬椋冶楊劉玲衿喬杵毅潅麓嗅諧* * "
"* * * ＹЧчｙ* * * 頴鰻咽鞍芦稗彬糞捧槙竃赫咳嘩襖鵡也妖掠怜芹卿砧嬉澗蝋喩訃* * "
"* * * ＺШшｚ* * * 惚杭虎桁隈舵托坦酎椎渚腫汐捌冴嬬擢菟蕩瀞漕賎棲壬裳鍋葱牌駁隼"
"* * * * Щщ* * * * 狛梗跨訣粂楕琢旦樗槌薯呪鴫錆阪紬鏑賭鐙噸痩閃栖腎醤楢捻楳函叛"
"* * * * Ъъ* * * * 此浩鈷倦栗陀鐸歎瀦鎚藷綬竺鮫堺吊溺鍍憧惇糟膳醒訊鉦馴撚煤硲斑"
"* * * * Ыы* * * * 坤糠伍喧鍬騨茸湛猪栂恕洲宍晒榊剃轍砥撞敦綜糎脆靭鍾畷廼狽箸氾"
"* * * * Ьь* * * * 梱紘吾拳卦堆凧箪苧掴鋤繍雫撒肴悌填砺萄沌聡噌戚笥鞘楠埜這肇釆"
])

(setq tcode-non-2-stroke-char-list
      (mapcar (function
	       (lambda (str)
		 (tcode-string-to-char str)))
	      '("*")))

(setq tcode-special-commands-alist
      '(((23 26) . tcode-mazegaki-begin-conversion) ; fj: 交ぜ書き変換
	;; ▽[LL | LR | RL | RR] 表
	((0 0) . (lambda () (tcode-show-tables nil nil)))
	((0 9) . (lambda () (tcode-show-tables nil t)))
	((9 0) . (lambda () (tcode-show-tables t nil)))
	((9 9) . (lambda () (tcode-show-tables t t)))
	))

;;; ttc-ltbl.el ends here.
