;;; try-etbl.el --- Try-Code extention table
;; Last modified : 20 February 2004

(setq tcode-tbl [
;□□□□□□□□□□ヮヰヱヵヶ請境系探象ゎゐゑ沖縄盛革突温捕肺宙泉署奮依繊借須訳
"■■■■■■■■■■■■■■箇錆堺譜偵■■■■翁糾■靴煙肌逮■■■■■■■惜煩■"

;□□□□□□□□□□丑臼宴縁曳尚賀岸責漁於汚乙穏捨益援周域荒拝暖誠縮腹織父枚乱香
"■■■■■■■■■■呪杵■■洩■謹浜貢猟■泥■■棄溢■垣圏慌祈緩■萎鼓縫爺■錯薫"

;□□□□□□□□□□鬼虚狭脅驚舎喜幹丘糖奇既菊却享康徒景処ぜ届誕聖縦晩譲ヘ模降走
"■■■■■■■■■■醜嘘挟■愕棟悦斡陵蜜綺■麹■烹■■■拠邪■露■斜酌醸■莫■駆"

;□□□□□□□□□□孤誇黄后耕布苦圧恵固巧克懇困昏邦舞雑漢緊潮臓仁尺班激干彦均又
"■■■■■■■■■■弧恥■妃■帆■■■頑朽■墾窮婚那踏蛮嘆■渦肝■勺斑禿乾諺衡且"

;□□□□□□□□□□奉某貌卜鋼姿絶密秘押詞至蚕穀磁衆節杉肉除俳頂染城陛測血散笑弁
"■■■■■■■■■■俸媒■朴■■拒粗囁抑枕■桑殻■■櫛■■削排峠浸砦殿秤汗撒藁升"

;□□□□□□□□□□湖礼著移郷息詩拾暑昭償欧努底亜悲柱笛童畑禁硝樹句礎皇像肥沿吸
"■■■■■■■■■■糊霊躇腎卿■篇■■■賠■怒■唖寂脊吹拐畝襟■吊旬楚朕肖■■吐"

;□□□□□□□□□□端飾郵塩群鳴星析遷宣紅傷豪維脱鼠曹奏尊刀絹被源願臨胸謝損俵灰
"■■■■■■■■■■尖■逓揉■■屑斤■宜紆瘍傑羅剥竄漕弾噂刃繭披■顧■■■■畳仄"

;□□□□□□□□□□刷寿順危砂庶粧丈称蒸舗充喫腕暴冬貝犬森林批慶渉竜併敬舌敵貧閣
"■■■■■■■■■■滲躊逐脆漠■■杖■窯■■契肢■鍋蟹伏■淋准■捗胆餅■舐■貪■"

;□□□□□□□□□□震扱片札乞暗乃如尼帳輪倒操柄魚馬歌絵弓晴就駐揮丹鮮穴銭銅墓机
"■■■■■■■■■■耐汲偏幌迄闇■奴僧簿鎖到繰丙鯨騎踊蒔弔■蹴屯渾■韓孔賎錘墳卓"

;□□□□□□□□□□弘痛票訴遺欄龍略慮累則存倍牛釈麦弟兄姉妹綱潟創背皮孝祖燃預貴
"■■■■■■■■■■■鎮■斥遣蘭襲侵虜塁■■■豚■■叔伯嬢娘■■■腰膚酵狙萌■雅"

;ヲ哀暇啓把酸昼炭稲湯果告策首農歩回務島開報紙館夜位給員ど代レ欠夏彼妻善相家的対歴
"■悼閑哲掴酢■■穂沸菓酷溺■濃這巡■嶋拓酬膜舘■爵餌■隷■檸陥蚊■凄膳宰軒■■暦"

;ゥ逢牙掲伐貿捜異隣旧概買詳由死キせ区百木音王放々応分よル千ア財針裏居差付プばュ作
"■遭塔謁■■■糞憐■慨購疎袖没■醤凶騰洞韻冠倣ゝ筈泌痒几箋荘■釣恨据羞附冥狽■駄"

;ヴ宛壊携避攻焼闘奈夕武残両在！や出タ手保案曲情引職７か（トれ従骨厚顔量内工八テ見
"■椀懐鞄辟■煮■捺宵賦虐双■喝■抽拶掌俣■屈惰魅殉■寡顰玩斂恭髄薄項糧■匠蛸〒眺"

;ヂ囲較劇卑盤帯易速拡風階能論増コ山者発立横興刺側覚きっ日国二適類御宇推九名川機チ
"■塀■遽碑旋滞勿敏■嵐皆罷倫噌珈凸箸廃坐脇勃剣筐醒畿■晶債弐嫡■■迂薦尻姓渓幾窒"

;ヅ庵寒賢藩汽換延雪互細古利ペゃナ金マ和女崎白ぐ官球上く８え年母奥因酒伸サ建パ第入
"■■塞愚■■喚■霜■些枯痢頁■■稼■■淑岬淡虞■粒崖■蜂■■婆■姻酔■■鍵■■挿"

;簡徴触宗植鼻索射濁慢害賃整軽評佐法数郎談服声任検豊美題井洋実爆仲茶率比昔短岩巨敗
"■微蝕崇鉢臭■輻澄漫阻■頓蔑■尉■薮廊冗裸艶赴倹潤麗是丼唐践■侶褐■此曾銃礁砲腐"

;承章候途複氷冊需詑迷撃折追隊角接備最急験変審改昇芸宿制集安画陽構旅施曜遠ォ将ぞ塚
"■勲侯徐■凍柵儒詫謎■誓鎚墜隅繋憂撮忙■妙陪訂■稽泊癌焦廉函暢溝■■濯■■棋■■"

;快否歯筆里油皿輯蓄戻浴秀糸春幸記朝知ワ送限研労統役セ運ツ特谷ァ導認健尾序振練念働
"愉肯噛硯厘脂蓋轄畜■槽誘弦貼辛綴暁智■贈尽■疲■股■搬■殊凹■■忍腱梶秩娠錬捻雇"

;包納頼逃寝緑賛瞬貯羊積程断低減モ資士費ィ逆企精ざ印神び打勤ャ殺負何履般耳授版効視
"抱鞘■囚眠紫讃■■姪漬呈遮抵滅檬■侍■■遡■妖暫璽仙琵殴僅■絞貞伺■俗壁■■劾盲"

;唱暮憲勉罪芽飲盾虫泳故鉱提児敷無石屋解募令違装然確優公品語演券悪秋非便示即難普辺
"昌■■■罰摘渇矛昆潜■炉堤胎■謬鹸握剖慕詔偉壮■■劣郭謳彙壇■魔愁斐尿■■灘珍磯"

;ぱ慰我兼菱桜瀬鳥催障収際太園船中スもお定種岡結進真３と→てるヒ江別考権ッ人三京ち
"■■輩謙■楼■鶏■碍穫■汰苑舟庸縞猛扇錠痘■■椎慎珊賭零剃■琲■捌敲覇■猿叉涼馳"

;ぴ為掛嫌紐典博筋忠乳若雄査ふ賞わラ東生ろ宅熟待取科ーした一が及久蔵早造ロク万方フ
"雛偽卦厭縛■■■■搾匿雌■耽■琶薇陳涯狼邸塾款奪斗■恣叩壱餓■灸■■捏呂倶■芳燐"

;ぷ陰敢顕描採謡希仏察指氏丸続ェう４）十リ料土活ね参い、の５１投義算半県んまンつ四
"■謀瞰■猫■揺稀悟擦旨■筒継妬鬱閏蹙柔■■壌括■惨鋳，■瑚吠匙儀桁伴懸■磨■嗣匹"

;ぺ隠甘牽憤君純副盟標ぎ格次習火あこ６学月受予切育池。◆０・２込沢軍青清けイす電地
"潰蔽飴■噴豹鈍■■漂欺■羨摺炎或仔■奨崩妥猶斬培柳．■塗■壷■■艦紺粛罫訊枢雷獄"

;ぽ胃患厳弊犯余堀肩療思術広門聞本さら高シ英ボ加室少ではになを転空性使級業時「長み
"■謂串威幣■剰掘撲瞭偲■寛閃聴奔唆拉稿■俊釦架■沙■綻匂撫■舵控牲■■■泡『悠■"

;朱遅甲致汎旗衰滋沈己病終起路越む南原駅物勢必講愛管要設水藤有素兵専親寮ホ共ブ平楽
"雀迅■■凡竿■慈浮杞疫遂励遍超霧■漆■唯■■■曖菅■■蛍■賄玄■■戚僚■洪呟泰娯"

;陣鶴鹿貨絡泣趨湿添已常張薬防得ケ式戦関男輸形助◇流連鉄教力ベ毛永申袋良私ゴ来信午
"■亀麓■■叫皺燥■■恒脹剤妨獲■拭慄堰紳諭■肋■硫載鉛勅逞■髪劫呻堪佳僕檎狂託缶"

;眼繁誌招季救垂甚徹巳寺質づ港条話座線ダ橋基好味宝争デ現エ他度等浅頃落命村ガ製校ご
"隻■■聘■■睡勘撤■禅躓■湾篠喋挫腺■矯其嗜昧■訟歪■■弛硬■桟傾■魂蕪■■■碁"

;執紹夢卸阿鏡粋荷爪巴停領容玉右べ民ソ点遇足草築観言車成天世文板客師税飛ノ完重約各
"摯■儚■呆■趣梱琴■亭頒溶珠銘■罠■滴偶脚藻筑傍曰滑促床泄拙盆賓帥鋭跳〆璧衝■酪"

;岳刑弱雲窓訓寸瞳陶祭河置供試席期ゾ歳強係婦段衛額渋主映書可へ伝庭課着坂近外米ョ光
"峰■軟曇扉躾肘濡淘■滝措叱挑■斯■齢剛■嫁鍛惑頬■坊■斎苛■云■■膠■漸郊坪■輝"

;ぁ熊瓦幕梨呼幅歓功盗徳渡守登退店持町所ほ件友卒初慣行ド円小ジヨ誤証含％海道ず西げ
"■■瓶葛■甥巾勧■窃■亘遵■腿■堅■詮褒■網■裕馴逝棺虹■嫉■呉■頷■賊軌■栗■"

;ぃ媛覧棒埼紀破郡抗幡械刊訪融雨全じ自議明宮伊求技写通カ社野同判規感値ギ当理メウグ
"■姫閲軸■■砕■坑播戒■尋隔傘■靱汝犠透廷膝■妓謄貫臆■獣飽■■憾■諦該埋爽烏■"

;ぅ阪卵亡栃房績識属衣帝始了極熱バ部六経動局頭配黒院だり…め大済吉ゆ器照不合面政オ
"■■卯葬■厨紡熾嘱裳締黎■■灼薔■■緯躍■帽勾墨■唾裡黙■膨斉祥尤杯■妊恰麺摂■"

;ぇ岐翌閉茨去疑ぢ綿離読鈴恐督況後間場ニ産向府富直倉新」９子五説週号葉派委化ビ目市
"■峡■封■怯凝痔錦距詠鐘怖瞥■悔隙揚■■婿俯冨殖槍薪』殆胞吾■■符諜閥諮幽■涙柿"

;ぉ阜律幼俺秒範核影麻族丁未才返問ム七住北割ぶ番望元事田会前そ休省央福毎気売下都株
"■埠■稚漏抄疇骸幻摩■寧■■蛙拷挨癖■乖裂辱翻■旦■畔桧揃塑憩懲芯祉侮雰嬉堕■菌"

;欲巣茂述朗似臣灯牧往帰庁昨跡ゲ洗羽個医静億録赤想消支協用表正図挙険ゼ波ヤ心界意今
"慾窟藪叙■■臥燈■■掃■詐痕戴浄翼■■騒憶■嚇妄耗伎■■彰征鑑拳冒■浪■衷租随吟"

;迫災恋脳老仮径束毒脈監寄裁達芝響忘討史環色貸販編仕先多商ハ交之末ぼ街免再ネ〜口台
"■厄憎悩鞭狩怪拘■拍濫椅栽■刈饗忌■吏循彩■賑騙■銑頻■只盃乏抹肪■挽■■蛇唇怠"

;留列刻豆看潔菜孫梅勇竹注介具失司迎華許補左態花栄ザ調混ポ決ミ州払乗庫状団計夫食総
"溜烈彫芋診■■遜桃湧笹註芥惧喪覗仰■諾■楕擬咲誉■■掻■■■洲■搭■症塊■■飢聡"

;替沼？辞献枝祝兆飯液ゅ修究答養復並浦ユ冷ぬ展警型誰組選党択体例満津準遊戸ひょ価与
"■召痴■■■■銚炊汁■繕■■扶覆■蒲■■■■■枠■■■■■胴■詰■■戯籍樋■■貰"

;還更占箱矢飼松腸粉恩志抜航層深担陸巻競護根様独止堂銀以ヌ営治字材過諸単身ピ勝反ズ
"■迭粘棚疾■■賜紛赦篤栓舶曽■但隆捲■擁茎紋逸釘■箔■■■癒苗■禍緒匁艇■兜■■"
])

(setq tcode-non-2-stroke-char-list
      (mapcar (function
	       (lambda (str)
		 (tcode-string-to-char str)))
	      '("■" "◆" "◇")))

(setq tcode-special-commands-alist
      '(
	((40) . try-code-space)
	((0 0) . (lambda () (tcode-show-tables nil nil)))
	((0 9) . (lambda () (tcode-show-tables nil t)))
	((9 0) . (lambda () (tcode-show-tables t nil)))
	((9 9) . (lambda () (tcode-show-tables t t)))
	))

(defun try-code-space ()
  (interactive)
  (call-interactively (or (lookup-key tcode-mode-map " ")
			  'self-insert-command)))

;;; try-etbl.el ends here
