;;; ttc-rtbl.el --- TT-Code right table data

(setq tcode-tbl [
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ［＃* "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ｛＆* "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ｝＊* "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ］＠* "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * "
"* * * * * ‾℃＜√⊂冠嚇蚊猿緯沿弓穀拾舌憩吟凶儀鑑兆燃肥幕零傘鎖酵孔遣漏；〔♪←"
"* * * * * ＾″≦♀⊆乾垣菓煙尉液吸鋼尺誠契謹距偽貫柱届悲妹隷擦詐郊坑軒浪：【♭↓"
"* * * * * ｀′≧♂⊇刈該箇炎威泳貴皇謝聖傾襟拠騎艦宙毒晩牧林撮唆購侯謙楼‥】♯↑"
"* * * * * ゜°＞∴⊃且涯稼閲偉飲旗孝捨晴薫菌拒飢肝暖銅飯棒緑錯魂貢碁懸廊｜〕†→"
"* * * * * * Å≠∞⇒轄慨禍謁握暗机犬磁仁勲琴糾輝缶誕童班亡律搾紺衡悟堅露‖* ‡¶"
"* ┏┌* * * * * * * 焦巡醜勺諮泥悼篤悩舶措拙枢尋醸蛮頻伏慕傍漬弔胆泰藻没妙匁庸痢"
"* * * * * * * * * * 症遵柔爵賜摘搭凸濃薄疎摂据尽錠妃敏覆簿剖坪彫鍛滞遭奔眠厄揚硫"
"┯┳┬┰* * * * * * 礁緒汁酌雌滴桃屯覇漠租窃澄迅嘱扉瓶沸倣坊釣懲壇胎霜翻矛躍揺粒"
"* * * * * * * * * * 祥叙獣寂侍哲棟豚婆縛粗仙畝酢殖披怖噴俸妨亭挑弾逮騒凡霧柳擁隆"
"* ┓┐* * * * * * * 肖徐銃殊慈撤痘曇廃肌阻扇是吹辱泌扶墳峰帽偵眺恥滝憎盆婿愉溶虜"
"* * * * * ＿£−⌒∈寛隔悔沖韻荷訓枝署像鶏隅狂犠幾弟拝腹勇劣嗣砕獄洪枯* 〆《☆★"
"* * * * * ¨¢÷⊥∋堪郭怪翁姻歌鏡姉暑祖蛍偶挟欺岐頂俳貧油暦伺栽酷控弧湾仝〈△▲"
"* * * * * ´＄×∠∩喚穫塊殴芋仮胸蚕縮銭茎虞恭擬頑腸，氷鳴齢暫彩拷拘玄枠〃〉□■"
"* * * * * ゛¥＋∵∪勧獲餓凹逸恩泣菜祝染継愚峡戯陥．* 俵…麗桟宰剛慌弦惑／》○●"
"* * * * * * ‰＝∽⇔勘殻雅鉛壱往救祭縦泉渓駆叫宜閑潮馬鼻脈霊惨債項恒幻賄＼『◯§"
"┠┣├┝* * * * * * 衝匠叔狩璽迭筒鈍排鉢僧栓姓帥侵疲浮紛崩忙貞聴痴卓贈摩娘癒窯僚"
"* ┃│* * * * * * * 訟升淑珠軸殿到縄杯髪双潜征* 唇碑符雰抱冒呈脹稚拓促磨銘諭踊涼"
"* ━─* * * * * * * 詔召粛趣漆吐謄軟輩罰喪旋牲炊娠罷腐丙泡紡堤超畜濯俗魔滅唯抑猟"
"┿╋┼╂* * * * * * 鐘奨塾儒疾塗踏弐培閥壮薦誓睡慎微膚塀砲肪廷跳逐託賊埋妄幽翼糧"
"┨┫┤┥* * * * * * 冗宵俊囚赦斗透尿媒伴掃践逝遂浸匹譜幣縫膨抵勅秩諾堕膜猛悠羅陵"
"* * * * * * * ≪∬∃緩褐劾架悦閣穴似臣損圏桑斤窮軌灯畑墓覧炉脂削昆肯娯* ヾ“　〓"
"* * * * * * * ≒∫∀汗滑皆寡疫貝潔飼森孫剣繰暁朽祈刀麦陛卵錬肢咲恨絞呉* ヽ‘▽▼"
"* * * * * * * ≡∇∧款渇拐嫁鋭絵敬詩城束倹靴凝虐棄冬梅閉翌廉紫剤婚稿鼓* ゞ’◇◆"
"* * * * * * * ≫∂∨棺括戒佳詠灰径詞松息傑掘仰脚棋笛』粉幼裂祉載墾硬顧* ゝ”◎※"
"* * * * * * * ±∝¬憾喝懐憶渦芽兄至昭臓鯨屈矯詰忌敵肺奮預烈旨斎腰溝雇* ‐* * 〒"
"* ┗└* * * * * * * 剰床准愁斜奴騰妊賠帆挿銑斉酔紳姫賦壁胞謀締朕窒但妥抹盲憂裸倫"
"* * * * * * * * * * 壌彰循臭煮怒洞忍陪搬槽漸隻錘薪漂赴癖芳僕艇珍嫡奪惰繭網猶雷厘"
"┷┻┴┸* * * * * * 嬢抄旬舟遮凍胴寧伯畔燥禅惜随診苗附偏褒墨訂鎮抽棚駄漫耗裕酪塁"
"* * * * * * * * * * 浄掌殉襲蛇唐峠猫拍煩荘繕斥髄辛浜侮遍飽撲逓陳衷嘆耐魅黙誘濫涙"
"* ┛┘* * * * * * * 畳晶潤酬邪塔匿粘泊頒葬塑籍崇刃賓封穂乏朴邸墜鋳淡怠岬紋誉吏励"
])

(setq tcode-non-2-stroke-char-list
      (mapcar (function
	       (lambda (str)
		 (tcode-string-to-char str)))
	      '("*")))

(setq tcode-special-commands-alist
      '(
	((26 23) . tcode-bushu-begin-conversion) ; jf : 部首合成変換の開始
	;; ▲[LL | LR | RL | RR] 表
	((0 0) . (lambda () (tcode-show-tables nil nil)))
	((0 9) . (lambda () (tcode-show-tables nil t)))
	((9 0) . (lambda () (tcode-show-tables t nil)))
	((9 9) . (lambda () (tcode-show-tables t t)))
	))

;;; ttc-rtbl.el ends here
